"""
Задание 3: Последний символ строки
"""
txt = input("Введите строку: ")
print(txt[-1])