"""
Задание 4: Количество цифр
"""
num = int(input("Введите число: "))
print(len(str(abs(num))))