"""
Задание 2: Последняя цифра числа
"""
num = int(input("Введите число: "))
print(abs(num) % 10)