"""
Задание 2: Длина строки
"""
txt = input("Введите строку: ")
print(len(txt))