"""
Задание 5: Числа кратные 3 от 1 до 100
"""
for i in range(1, 101):
    if i % 3 == 0:
        print(i)