"""
Задание 6: Проверка длины списка
"""
tst = ['a', 'b', 'c', 'd', 'e']

if 0 < len(tst) < 6:
    print("Длина списка меньше 6 и больше 0")