"""
Задание 4: Проверка на None
"""
tst = 'abc'

if tst is not None:
    print("Значение не равно None")