"""
Задание 1: Проверка на четность
"""
num = int(input("Введите число: "))
if num % 2 == 0:
    print("Четное")
else:
    print("Нечетное")