"""
Задание 2: Длина строки
"""
txt = 'ab cd ef'
print(len(txt))